<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"67baa3e058e771ae6bc17eb758a4a4a752087cac6bd220c2d12d5f009ebdf0d0","plan_job_ref":"Job Terraform Plan #314 at https://github.com/cal-itp/data-infra/actions/runs/15918612061","plan_out_hash":"2d0c5f4e974417c55e69b33c631cc7deab50f683576e8b1780568cc2b3ce548d","plan_hash":"d18ceb1df672be83da98501decc2139e7b07f62d02c2e8881fe587a1de3aad3b","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 1 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-   destroy

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer-partial_parse will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-partial_parse" {
!~      content             = (sensitive value)
!~      crc32c              = "/StLww==" -> (known after apply)
!~      detect_md5hash      = "hV7oGh5Gb82NQ2/leobQzg==" -> "different hash"
!~      generation          = 1750999013448994 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/partial_parse.msgpack"
!~      md5hash             = "hV7oGh5Gb82NQ2/leobQzg==" -> (known after apply)
        name                = "data/warehouse/target/partial_parse.msgpack"
#        (15 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-run_results will be destroyed
  # (because google_storage_bucket_object.calitp-staging-composer-run_results is not in configuration)
-   resource "google_storage_bucket_object" "calitp-staging-composer-run_results" {
-       bucket              = "calitp-staging-composer" -> null
-       content             = (sensitive value) -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "RwM3QA==" -> null
-       detect_md5hash      = "u2kPPLtWphhVQShX6jCBXQ==" -> null
-       event_based_hold    = false -> null
-       generation          = 1750447605108148 -> null
-       id                  = "calitp-staging-composer-data/warehouse/target/run_results.json" -> null
-       md5hash             = "u2kPPLtWphhVQShX6jCBXQ==" -> null
-       md5hexhash          = "bb690f3cbb56a61855412857ea30815d" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Ftarget%2Frun_results.json?generation=1750447605108148&alt=media" -> null
-       metadata            = {} -> null
-       name                = "data/warehouse/target/run_results.json" -> null
-       output_name         = "data/warehouse/target/run_results.json" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Ftarget%2Frun_results.json" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (5 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #314](https://github.com/cal-itp/data-infra/actions/runs/15918612061)